---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.SketchCurveNotModelable
source: html/748df7c1-e34e-aa8c-d29f-3b472d7815f1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.SketchCurveNotModelable Property

This action cannot be completed. An element created by massing has a sketch line that cannot be modeled.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchCurveNotModelable { get; }
```